import popul_gdp_energy as pge
import numpy as np

# 原始数据定义
# 区域人口总量数据，按年份顺序从左至右
P_o = np.array([7869.34, 8022.99, 8119.81, 8192.44, 8281.09, 8315.11, 8381.47, 8423.50, 8446.19, 8469.09, 8477.26])
# 区域GDP数据，按年份顺序从左至右
G_o = np.array([41383.87, 45952.65, 50660.20, 55580.11, 60359.43, 65552.00, 70665.71, 75752.20, 80827.71, 85556.13, 88683.21])
# 区域能源消耗量
energy_o = np.array([23539.31, 26860.03, 27999.22, 28203.10, 28170.51, 29033.61, 29947.98, 30669.89, 31373.13, 32227.51, 31438.00])
# 区域碳排放量
co2_o = np.array([56360.052, 65193.342, 67502.613, 66749.376, 64853.276, 66074.810, 68526.125, 70451.557, 71502.003, 74096.331, 72633.324])
# 起始年份
start_year = 2011
# 年份数
num_year = 10


if __name__ == '__main__':
    pge.do_cal(p_o=P_o, g_o=G_o, energy_o=energy_o, co2_o=co2_o, start_year=start_year, num_year=num_year, pre_num_year=40)
